res/cf/Catalogs/СерверыБазДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СерверыБазДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Серверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторизационныеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МенеджерПаролей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСервераБД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСерверовБД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

res/cf/Enums/ТипыСерверовБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыСерверовБД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>MSSQL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PostgreSQL</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

res/cf/Catalogs/Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Проекты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитИнформационныхБаз</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРепозиторияГит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобиратьТэги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрешенныеСерверы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сервер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Серверы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОсновныеВетки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяВетки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыТелеграмм</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКанала</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТелеграм</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗащищенныеКонтуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контур</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

res/cf/Catalogs/СерверыБазДанных/Ext/ManagerModule.bsl
Функция ПолучитьПараметрыСервера(Сервер) Экспорт
	
	ДанныеСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сервер, "Наименование,ТипСервераБД,АвторизационныеДанные");
	ПараметрыСервера = ПараметрыСервераБД();
	ПараметрыСервера.ИмяСервера = ДанныеСсылки.Наименование;
	ПараметрыСервера.ТипСервера = ПолучитьПредставлениеТипаСервераБД(ДанныеСсылки.ТипСервераБД);
	Если ЗначениеЗаполнено(ДанныеСсылки.АвторизационныеДанные) Тогда
		ПараметрыСервера.АдминистраторБД = ДанныеСсылки.АвторизационныеДанные.Логин;
		ПараметрыСервера.ПарольБД = ДанныеСсылки.АвторизационныеДанные.Пароль;
	КонецЕсли;
	
	Возврат ПараметрыСервера;
	
КонецФункции

Функция ПараметрыСервераБД()

	ПараметрыСервера = Новый Структура;
	ПараметрыСервера.Вставить("ИмяСервера", "");
	ПараметрыСервера.Вставить("ТипСервера", "");
	ПараметрыСервера.Вставить("АдминистраторБД", "");
	ПараметрыСервера.Вставить("ПарольБД", "");
	
	Возврат ПараметрыСервера;

КонецФункции // ПараметрыСервераБД()

Функция ПолучитьПредставлениеТипаСервераБД(ТипСервера)

	Если ТипСервера = Перечисления.ТипыСерверовБД.MSSQL Тогда
		Возврат "MSSQLServer";
	ИначеЕсли ТипСервера = Перечисления.ТипыСерверовБД.PostgreSQL Тогда
		Возврат "PostgreSQL";
	Иначе
		ВызватьИсключение "Неизвестный тип сервера БД!";
	КонецЕсли;

КонецФункции // ПолучитьПредставлениеТипаСервераБД()

Функция ПолучитьСписокДляВыбора(Проект) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Проект) Тогда
		ВызватьИсключение "Укажите проект!";
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СерверыБазДанных.Ссылка КАК Ссылка,
	               |	СерверыБазДанных.Представление КАК Представление
	               |ИЗ
	               |	Справочник.СерверыБазДанных КАК СерверыБазДанных
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты.РазрешенныеСерверы КАК ПроектыРазрешенныеСерверы
	               |		ПО СерверыБазДанных.Сервер = ПроектыРазрешенныеСерверы.Сервер
	               |ГДЕ
	               |	ПроектыРазрешенныеСерверы.Ссылка = &Проект";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Результат = Новый СписокЗначений();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка, Выборка.Представление);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции // ПолучитьСписокДляВыбора()
